#MADE BY GIGI/Robert

import random
import time

randomm = ["v1","v2","v3"]
random2 = random.choice(randomm)

print("minecraft is loading get ready")


for i in range(5,100,5):
    time.sleep(0.2)
    print("\r", i+5 , "%", end="")

print("\ndone!")
def minecraf_logo():
    print("\n\n\n\n\n               ⠀⠀⡰⠉⠉⣷⡄⣀⣎⠉⢹⡎⠉⢉⡞⠉⠉⣧⡎⠉⠉⡞⠉⠉⠉⠉⠉⣿⠉⠉⠉⠉⠉⢹⡏⠋⠉⠉⠉⠙⡏⠉⣉⠉⣉⠉⢿⠉⠉⠉⢉⠉⢱⡏⠉⠉⠉⢉⠉⡄\n"
          "⠀               ⢀⠃⠀⠀⠘⠛⠁⠀⠀⣼⠀⠀⣸⠃⠀⠀⠘⠃⠀⢰⡇⠀⠀⠛⠛⠛⣿⠀⠀⢸⣿⣿⣿⡇⠀⠈⠃⠀⣠⣿⠀⠉⣶⣍⠀⢸⡆⠀⠘⠛⠛⠛⣿⣿⡆⠀⠈⡟⠁  .\n"
          "⠀               ⡜⣀⢀⣶⣀⣰⠆⠀⢀⡏⠀⠀⣿⠀⠀⣸⣄⠤⠄⢸⠃⠀⢰⣶⣶⣶⣿⠀⠀⢸⣉⣉⣉⡇⡀⠀⣶⠀⠀⢹⠀⠀⢀⡀⢀⠀⣇⠀⠀⢶⣶⣶⢾⣿⣿⡀⠀⢱⠀ .\n"
          "               ⢰⠀⠀⢸⣿⣦⠈⠀⠀⢼⠁⠀⢰⡇⠀⠀⣿⣿⠀⠀⢼⠀⡄⠀⠀⠀⠀⣿⠀⠀⠀⠀⠀⢸⡇⠂⠀⣿⠀⠀⢸⡆⠀⢘⡧⠀⠀⣿⠀⠀⢸⠛⠃⠘⣿⣿⡇⠀⠀⡆   .\n"
          "               ⠀⠑⢤⣀⣙⡿⠉⠱⣄⣠⣷⣄⣀⣹⣄⣀⣘⡏⢆⣀⣘⣧⣀⣀⣀⣀⣀⣿⣀⣀⣀⣀⣀⣸⣇⣀⣰⣏⣀⣠⣿⣀⣀⣾⣁⣀⣴⣋⣀⡠⠃⠀⠀⠀⢿⣋⣀⡤⠋⠀\n")
minecraf_logo()
print("\n                                                                    🟦            \n"
                      "                                                                  🟦🟦🟦          \n"
                      "                                                                🟦🟦🟦🟦🟦       \n"
                      "     ↖↕↗ > you                                                      ⬛             \n"
                      "                                  ↖↕↗                               ⬛            \n"
                      "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")

# 🟥🟧🟨🟩🟪🟫⬛⬜
# 🔴🟠🟡🟢🔵🟣🟤⚫⚪

while True:
    print("lets make our way home now")
    response1 = input("(press A to say a joke)\nW-move forward\nS-jump\nd-move forward\n choose one : ").lower()
    if response1 == "d":
        while True:
            minecraf_logo()
            print("\n                                                                    🟦            \n"
                  "                                                                  🟦🟦🟦          \n"
                  "                                                                🟦🟦🟦🟦🟦       \n"
                  "                                                                    ⬛             \n"
                  "                        ↖↕↗                                         ⬛            \n"
                  "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
                  "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                  "\n")
            responseC = input("W-move forward\nS-jump\n choose one : ").lower()
            if responseC == "w":
                minecraf_logo()
                print("\n                                                                    🟦            \n"
                      "                                                                  🟦🟦🟦          \n"
                      "                                                                🟦🟦🟦🟦🟦       \n"
                      "                                                                    ⬛             \n"
                      "                                  ↖↕↗                               ⬛            \n"
                      "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                break
            elif responseC == "s":
                minecraf_logo()
                print("\n                                                                   🟦            \n"
                      "                                                                  🟦🟦🟦          \n"
                      "                                                                🟦🟦🟦🟦🟦       \n"
                      "                        ↖↕↗                                         ⬛             \n"
                      "                                                                    ⬛            \n"
                      "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                time.sleep(0.6)
                minecraf_logo()
                print("\n                                                               🟦            \n"
                      "                                                                  🟦🟦🟦          \n"
                      "                                                                🟦🟦🟦🟦🟦       \n"
                      "                                                                    ⬛             \n"
                      "                        ↖↕↗                                         ⬛            \n"
                      "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
            else:
                print("\n[please select an option]\n")

    elif response1 == "w":
        minecraf_logo()
        print("\n                                                                    🟦            \n"
              "                                                                  🟦🟦🟦          \n"
              "                                                                🟦🟦🟦🟦🟦       \n"
              "                                                                    ⬛             \n"
              "                                           ↖↕↗                      ⬛            \n"
              "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
        break
    elif response1 == "s":
        minecraf_logo()
        print("\n                                                                    🟦            \n"
              "                                                                  🟦🟦🟦          \n"
              "                                                                🟦🟦🟦🟦🟦       \n"
              "                                 ↖↕↗                                ⬛             \n"
              "                                                                    ⬛            \n"
              "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
        time.sleep(0.6)
        minecraf_logo()
        print("\n                                                                    🟦            \n"
              "                                                                  🟦🟦🟦          \n"
              "                                                                🟦🟦🟦🟦🟦       \n"
              "                                                                    ⬛             \n"
              "                                 ↖↕↗                                ⬛            \n"
              "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
    elif response1 == "a":
        minecraf_logo()
        print("\n                                                                    🟦            \n"
              "       Why don't skeletons fight each other?                      🟦🟦🟦          \n"
              "         Because they don't have the guts!                     🟦🟦🟦🟦🟦       \n"
              "                                .                                   ⬛             \n"
              "                                 ↖↕↗                                ⬛            \n"
              "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
    else:
        print("\n[please select an option]\n")

while True:
    response2 = input("(press n to nuke venezuela)\nW-move forward\nD-move backwards\nS-jump\n choose one : ").lower()
    if response2 == "d":
        minecraf_logo()
        print("\n                                                                    🟦            \n"
              "                                                                  🟦🟦🟦          \n"
              "                                                                🟦🟦🟦🟦🟦       \n"
              "                                                                    ⬛             \n"
              "                                  ↖↕↗                               ⬛            \n"
              "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
        while True:
            responseA = input("(press A to say muie mihai)\nW-move forward\nS-jump\n choose one : ").lower()
            if responseA == "w":
                minecraf_logo()
                print("\n                                                                    🟦            \n"
                      "                                                                  🟦🟦🟦          \n"
                      "                                                                🟦🟦🟦🟦🟦       \n"
                      "                                                                    ⬛             \n"
                      "                                           ↖↕↗                      ⬛            \n"
                      "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                break
            elif responseA == "s":
                minecraf_logo()
                print("\n                                                                    🟦            \n"
                      "                                                                  🟦🟦🟦          \n"
                      "                                                                🟦🟦🟦🟦🟦       \n"
                      "                                 ↖↕↗                                ⬛             \n"
                      "                                                                    ⬛            \n"
                      "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                time.sleep(0.6)
                minecraf_logo()
                print("\n                                                                    🟦            \n"
                      "                                                                  🟦🟦🟦          \n"
                      "                                                                🟦🟦🟦🟦🟦       \n"
                      "                                                                    ⬛             \n"
                      "                                 ↖↕↗                                ⬛            \n"
                      "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
            elif responseA == "a":
                minecraf_logo()
                print("\n                                                                    🟦            \n"
                      "       Why don't skeletons fight each other?                      🟦🟦🟦          \n"
                      "         Because they don't have the guts!                     🟦🟦🟦🟦🟦       \n"
                      "                                .                                   ⬛             \n"
                      "                                 ↖↕↗                                ⬛            \n"
                      "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
            else:
                print("\n[please select an option]\n")
    elif response2 == "w":
        minecraf_logo()
        print("\n                                                                    🟦            \n"
              "                                                                  🟦🟦🟦          \n"
              "                                                                🟦🟦🟦🟦🟦       \n"
              "                                                                    ⬛             \n"
              "                                                                    ⬛            \n"
              "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩         ↖↕↗ 🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
        break
    elif response2 == "s":
        minecraf_logo()
        print("\n                                                                    🟦            \n"
              "                                                                  🟦🟦🟦          \n"
              "                                                                🟦🟦🟦🟦🟦       \n"
              "                                           ↖↕↗                      ⬛             \n"
              "                                                                    ⬛            \n"
              "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
        time.sleep(0.6)
        minecraf_logo()
        print("\n                                                                    🟦            \n"
              "                                                                  🟦🟦🟦          \n"
              "                                                                🟦🟦🟦🟦🟦       \n"
              "                                                                    ⬛             \n"
              "                                           ↖↕↗                      ⬛            \n"
              "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
    elif response2 == "n":
        minecraf_logo()
        while 1 == 1:
            i = print("#%#%#%#%#%#%#%##%#%#%#%#%#%#%##%#%#%#%#%#%#%##%#%#%#%#%#%#%##%#%#%#%#%#%#%##%#%#%#%#%#%#%#")

    else:
        print("\n[please select and option]\n")

while True:
    response3 = input("(press e to smile!)\n W-move forward\n S-jump\n D-move forward\n  choose one : ").lower()
    if response3 == "d":
        minecraf_logo()
        print("\n                                                                    🟦            \n"
              "                                                                  🟦🟦🟦          \n"
              "                                                                🟦🟦🟦🟦🟦       \n"
              "                                                                    ⬛             \n"
              "                                           ↖↕↗                      ⬛            \n"
              "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
        while True:
            responseK = input("(press n to nuke venezuela)\nW-move forward\nS-jump\n choose one : ").lower()

            if responseK == "w":
                minecraf_logo()
                print("\n                                                                    🟦            \n"
                      "                                                                  🟦🟦🟦          \n"
                      "                                                                🟦🟦🟦🟦🟦       \n"
                      "                                                                    ⬛             \n"
                      "                                                                    ⬛            \n"
                      "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩         ↖↕↗ 🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                break
            elif responseK == "s":
                minecraf_logo()
                print("\n                                                                    🟦            \n"
                      "                                                                  🟦🟦🟦          \n"
                      "                                                                🟦🟦🟦🟦🟦       \n"
                      "                                           ↖↕↗                      ⬛             \n"
                      "                                                                    ⬛            \n"
                      "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                time.sleep(0.6)
                minecraf_logo()
                print("\n                                                                    🟦            \n"
                      "                                                                  🟦🟦🟦          \n"
                      "                                                                🟦🟦🟦🟦🟦       \n"
                      "                                                                    ⬛             \n"
                      "                                           ↖↕↗                      ⬛            \n"
                      "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
            elif responseK == "n":
                while 1 == 1:
                    i = print(
                        "#%#%#%#%#%#%#%##%#%#%#%#%#%#%##%#%#%#%#%#%#%##%#%#%#%#%#%#%##%#%#%#%#%#%#%##%#%#%#%#%#%#%#")
            else:
                print("\n[please select an option]\n")
    elif response3 == "w":
        minecraf_logo()
        print("\n                                                                    🟦            \n"
              "                                                                  🟦🟦🟦          \n"
              "                                                                🟦🟦🟦🟦🟦       \n"
              "                                                                    ⬛             \n"
              "                                                                ↖↕↗ ⬛            \n"
              "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
        break
    elif response3 == "e":
        minecraf_logo()
        print("\n                                                                   🟦            \n"
              "                                                                 🟦🟦🟦          \n"
              "                                                               🟦🟦🟦🟦🟦       \n"
              "                                                                   ⬛             \n"
              "                                                ˙ᵕ˙ .              ⬛            \n"
              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩         ↖↕↗ 🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")

    elif response3 == "s":
        minecraf_logo()
        print("\n                                                                    🟦            \n"
              "                                                                  🟦🟦🟦          \n"
              "                                                                🟦🟦🟦🟦🟦       \n"
              "                                                                    ⬛             \n"
              "                                                       ↖↕↗          ⬛            \n"
              "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
        time.sleep(0.6)
        minecraf_logo()
        print("\n                                                                    🟦            \n"
              "                                                                  🟦🟦🟦          \n"
              "                                                                🟦🟦🟦🟦🟦       \n"
              "                                                                    ⬛             \n"
              "                                                                    ⬛            \n"
              "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩         ↖↕↗ 🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")

    else:
        print("\n[please select an option]\n")

while True:
    print("\nwow, you are in front of a tree")
    response4 = input("S-jump\nD-move backwars\nG-gather the tree\n choose one : ").lower()
    if response4 == "d":
        minecraf_logo()
        print("\n                                                                    🟦            \n"
              "                                                                  🟦🟦🟦          \n"
              "                                                                🟦🟦🟦🟦🟦       \n"
              "                                                                    ⬛             \n"
              "                                                                    ⬛            \n"
              "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩         ↖↕↗ 🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
        while True:
            responseS = input("(press e to smile!)\n W-move forward\n S-jump\n  choose one : ").lower()
            if responseS == "w":
                minecraf_logo()
                print("\n                                                                    🟦            \n"
                      "                                                                  🟦🟦🟦          \n"
                      "                                                                🟦🟦🟦🟦🟦       \n"
                      "                                                                    ⬛             \n"
                      "                                                                ↖↕↗ ⬛            \n"
                      "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                break
            elif responseS == "e":
                minecraf_logo()
                print("\n                                                                   🟦            \n"
                      "                                                                 🟦🟦🟦          \n"
                      "                                                               🟦🟦🟦🟦🟦       \n"
                      "                                                                   ⬛             \n"
                      "                                                ˙ᵕ˙ .              ⬛            \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩         ↖↕↗ 🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")

            elif responseS == "s":
                minecraf_logo()
                print("\n                                                                    🟦            \n"
                      "                                                                  🟦🟦🟦          \n"
                      "                                                                🟦🟦🟦🟦🟦       \n"
                      "                                                                    ⬛             \n"
                      "                                                       ↖↕↗          ⬛            \n"
                      "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                time.sleep(0.6)
                minecraf_logo()
                print("\n                                                                    🟦            \n"
                      "                                                                  🟦🟦🟦          \n"
                      "                                                                🟦🟦🟦🟦🟦       \n"
                      "                                                                    ⬛             \n"
                      "                                                                    ⬛            \n"
                      "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩         ↖↕↗ 🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
            else:
                print("\n[please select an option]\n")
    elif response4 == "g":
        minecraf_logo()
        print("\n                                                                    🟦            \n"
              "                                                                  🟦🟦🟦          \n"
              "                                                                🟦🟦🟦🟦🟦       \n"
              "                                                                    ⬛             \n"
              "                                                                ↖↕↗               \n"
              "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
        time.sleep(1)
        minecraf_logo()
        print("\n                                                                    🟦            \n"
              "                                                                  🟦🟦🟦          \n"
              "                                                                🟦🟦🟦🟦🟦       \n"
              "                                                                                   \n"
              "                                                                ↖↕↗               \n"
              "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
        time.sleep(1)
        minecraf_logo()
        print("\n                                                                    🟦            \n"
              "                                                                     🟦🟦          \n"
              "                                                                   🟦🟦  🟦       \n"
              "                                                                                   \n"
              "                                                                ↖↕↗               \n"
              "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
        time.sleep(1)
        minecraf_logo()
        print("\n                                                                    🟦            \n"
              "                                                                     🟦🟦          \n"
              "                                                                                     \n"
              "                                                                                   \n"
              "                                                                ↖↕↗               \n"
              "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
        time.sleep(1)
        minecraf_logo()
        print("\n                                                                                   \n"
              "                                                                                    \n"
              "        +3 wood                                                                    \n"
              "        +1 apple                                                                   \n"
              "        +6 leaves                                               ↖↕↗               \n"
              "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
        break
    elif response4 == "s":
        minecraf_logo()
        print("\n                                                                    🟦            \n"
              "                                                                  🟦🟦🟦          \n"
              "                                                                🟦🟦🟦🟦🟦       \n"
              "                                                                ↖↕↗ ⬛             \n"
              "                                                                    ⬛            \n"
              "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
        time.sleep(0.6)
        minecraf_logo()
        print("\n                                                                    🟦            \n"
              "                                                                  🟦🟦🟦          \n"
              "                                                                🟦🟦🟦🟦🟦       \n"
              "                                                                    ⬛             \n"
              "                                                                ↖↕↗ ⬛            \n"
              "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")

    else:
        print("\n[please select an option]\n")

while True:
    response5 = input("\nS-jump\nD-move backwards\nw-move forward\n choose one : ").lower()
    if response5 == "w":
        minecraf_logo()
        print("\n                                                                               \n"
              "                                                                                 \n"
              "                                                                                 \n"
              "                                                                                 \n"
              "                                                                              ↖↕↗   \n"
              "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
        break
    elif response5 == "d":
        minecraf_logo()
        print("\n                                                                                \n"
              "                                                                            \n"
              "                                                                      \n"
              "                                                                                 \n"
              "                                                                                \n"
              "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩         ↖↕↗ 🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
        while True:
            responseW = input("(press e to smile!)\n W-move forward\n S-jump\n  choose one : ").lower()
            if responseW == "w":
                minecraf_logo()
                print("\n                                                                               \n"
                      "                                                                                 \n"
                      "                                                                                 \n"
                      "                                                                                 \n"
                      "                                                                ↖↕↗             \n"
                      "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                break
            elif responseW == "e":
                minecraf_logo()
                print("\n                                                                                 \n"
                      "                                                                                   \n"
                      "                                                                                  \n"
                      "                                                                                  \n"
                      "                                                ˙ᵕ˙ .                           \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩         ↖↕↗ 🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")

            elif responseW == "s":
                minecraf_logo()
                print("\n                                                                                \n"
                      "                                                                                \n"
                      "                                                                                \n"
                      "                                                                                \n"
                      "                                                       ↖↕↗                      \n"
                      "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                time.sleep(0.6)
                minecraf_logo()
                print("\n                                                                               \n"
                      "                                                                            \n"
                      "                                                                       \n"
                      "                                                                                 \n"
                      "                                                                                \n"
                      "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩         ↖↕↗ 🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
            else:
                print("\n[please select an option]\n")
    elif response5 == "s":
        minecraf_logo()
        print("\n                                                                               \n"
              "                                                                                 \n"
              "                                                                                 \n"
              "                                                                ↖↕↗              \n"
              "                                                                                \n"
              "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
        time.sleep(0.6)
        minecraf_logo()
        print("\n                                                                               \n"
              "                                                                                 \n"
              "                                                                                 \n"
              "                                                                                 \n"
              "                                                                ↖↕↗              \n"
              "                       🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩             🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")

    else:
        print("\n[please select an option]\n")

def minecraf_logo2():
    print("\n\n\n\n\n               ⠀⠀⡰⠉⠉⣷⡄⣀⣎⠉⢹⡎⠉⢉⡞⠉⠉⣧⡎⠉⠉⡞⠉⠉⠉⠉⠉⣿⠉⠉⠉⠉⠉⢹⡏⠋⠉⠉⠉⠙⡏⠉⣉⠉⣉⠉⢿⠉⠉⠉⢉⠉⢱⡏⠉⠉⠉⢉⠉⡄\n"
          "⠀               ⢀⠃⠀⠀⠘⠛⠁⠀⠀⣼⠀⠀⣸⠃⠀⠀⠘⠃⠀⢰⡇⠀⠀⠛⠛⠛⣿⠀⠀⢸⣿⣿⣿⡇⠀⠈⠃⠀⣠⣿⠀⠉⣶⣍⠀⢸⡆⠀⠘⠛⠛⠛⣿⣿⡆⠀⠈⡟⠁  .\n"
          "⠀               ⡜⣀⢀⣶⣀⣰⠆⠀⢀⡏⠀⠀⣿⠀⠀⣸⣄⠤⠄⢸⠃⠀⢰⣶⣶⣶⣿⠀⠀⢸⣉⣉⣉⡇⡀⠀⣶⠀⠀⢹⠀⠀⢀⡀⢀⠀⣇⠀⠀⢶⣶⣶⢾⣿⣿⡀⠀⢱⠀ .\n"
          "               ⢰⠀⠀⢸⣿⣦⠈⠀⠀⢼⠁⠀⢰⡇⠀⠀⣿⣿⠀⠀⢼⠀⡄⠀⠀⠀⠀⣿⠀⠀⠀⠀⠀⢸⡇⠂⠀⣿⠀⠀⢸⡆⠀⢘⡧⠀⠀⣿⠀⠀⢸⠛⠃⠘⣿⣿⡇⠀⠀⡆   .\n"
          "               ⠀⠑⢤⣀⣙⡿⠉⠱⣄⣠⣷⣄⣀⣹⣄⣀⣘⡏⢆⣀⣘⣧⣀⣀⣀⣀⣀⣿⣀⣀⣀⣀⣀⣸⣇⣀⣰⣏⣀⣠⣿⣀⣀⣾⣁⣀⣴⣋⣀⡠⠃⠀⠀⠀⢿⣋⣀⡤⠋⠀\n")

ccc =input("wow you traveled a whole chunk by now, press enter to load a new one! : ")
minecraf_logo2()
print("                                                           \n"
      "                                                   ↖↕↗    \n"
      "                                              🟩🟩🟩🟩🟩🟩\n"
      "                                              🟫🟫🟫🟫🟫🟫\n")

print("                                                ... 3 ...")
time.sleep(1)
print("                                                 .. 2 ..")
time.sleep(1)
print("                                                  . 1 .")

variableC = ["partB", "partA"]

variable1 = ["mcB", "mcA"]
randome = random.choice(variable1)

if randome == 'mcB':
    variableC.remove("partB")
    minecraf_logo2()
    print("\n                                                                            \n"
          "                                                                                \n"
          "                                                                                \n"
          "                                           🟫                                    \n"
          "                          ↖↕↗          ⬛⬛⬛                                     \n"
          "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
          "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
          "\n")
    print("it seems like a small lake generated but lucky for you that there is a boat right there!")
    while True:
        response69 = input("press R to say i love water\nW-move forward\ns-jump\n choose one : ").lower()
        if response69 == "r":
            minecraf_logo2()
            print("\n                                                                            \n"
                  "                                                                                \n"
                  "                                                                                \n"
                  "           i love water! .                 🟫                                    \n"
                  "                          ↖↕↗          ⬛⬛⬛                                     \n"
                  "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                  "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                  "\n")
        elif response69 == "w":
            minecraf_logo2()
            print("\n                                                                            \n"
                  "                                                                                \n"
                  "                                                                                \n"
                  "                                           🟫                                    \n"
                  "                                   ↖↕↗ ⬛⬛⬛                                     \n"
                  "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                  "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                  "\n")
            break
        elif response69 == "s":
            minecraf_logo2()
            print("\n                                                                            \n"
                  "                                                                                \n"
                  "                                                                                \n"
                  "                          ↖↕↗              🟫                                    \n"
                  "                                       ⬛⬛⬛                                     \n"
                  "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                  "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                  "\n")
            time.sleep(0.6)
            minecraf_logo2()
            print("\n                                                                            \n"
                  "                                                                                \n"
                  "                                                                                \n"
                  "                                           🟫                                    \n"
                  "                          ↖↕↗          ⬛⬛⬛                                     \n"
                  "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                  "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                  "\n")
        else:
            print("\n[please select an option]\n")
    while True:
        response69 = input("press R to say something important\nD-move backwards\nW-get in the boat\nS-jump\n choose one : ").lower()
        if response69 == "d":
            minecraf_logo2()
            print("\n                                                                            \n"
                  "                                                                                \n"
                  "                                                                                \n"
                  "                                           🟫                                    \n"
                  "                          ↖↕↗          ⬛⬛⬛                                     \n"
                  "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                  "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                  "\n")
            print("it seems like a small lake generated but lucky for you that there is a boat right there!")
            while True:
                response68 = input("press R to say i love water\nW-move forward\ns-jump\n choose one : ").lower()
                if response68 == "r":
                    minecraf_logo2()
                    print("\n                                                                            \n"
                          "                                                                                \n"
                          "                                                                                \n"
                          "           i love water! .                 🟫                                    \n"
                          "                          ↖↕↗          ⬛⬛⬛                                     \n"
                          "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                          "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                          "\n")
                elif response68 == "w":
                    minecraf_logo2()
                    print("\n                                                                            \n"
                          "                                                                                \n"
                          "                                                                                \n"
                          "                                           🟫                                    \n"
                          "                                   ↖↕↗ ⬛⬛⬛                                     \n"
                          "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                          "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                          "\n")
                    break
                elif response68 == "s":
                    minecraf_logo2()
                    print("\n                                                                            \n"
                          "                                                                                \n"
                          "                                                                                \n"
                          "                          ↖↕↗              🟫                                    \n"
                          "                                       ⬛⬛⬛                                     \n"
                          "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                          "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                          "\n")
                    time.sleep(0.6)
                    minecraf_logo2()
                    print("\n                                                                            \n"
                          "                                                                                \n"
                          "                                                                                \n"
                          "                                           🟫                                    \n"
                          "                          ↖↕↗          ⬛⬛⬛                                     \n"
                          "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                          "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                          "\n")
                else:
                    print("\n[please select an option]\n")
        elif response69 == "r":
            minecraf_logo2()
            print("\n                                                                             \n"
                  "                                                                                \n"
                  "      did you know that                                                         \n"
                  "       Robert aka GIGI made this? .        🟫                                    \n"
                  "                                   ↖↕↗ ⬛⬛⬛                                    \n"
                  "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                  "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                  "\n")
        elif response69 == "w":
            minecraf_logo2()
            print("\n                                                                            \n"
                  "                                                                                \n"
                  "                                                                                \n"
                  "                                       ↖↕↗ 🟫                                    \n"
                  "                                       ⬛⬛⬛                                     \n"
                  "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                  "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                  "\n")
            time.sleep(1)
            minecraf_logo2()
            print("\n                                                                            \n"
                  "                                                                                \n"
                  "                                                                                \n"
                  "                                             ↖↕↗ 🟫                            \n"
                  "                                             ⬛⬛⬛                             \n"
                  "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                  "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                  "\n")
            time.sleep(1)
            minecraf_logo2()
            print("\n                                                                            \n"
                  "                                                                                \n"
                  "                                                                                \n"
                  "                                                   ↖↕↗ 🟫                       \n"
                  "                                                   ⬛⬛⬛                       \n"
                  "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                  "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                  "\n")
            time.sleep(1)
            minecraf_logo2()
            print("\n                                                                            \n"
                  "                                                                                \n"
                  "                                                                                \n"
                  "                                                         ↖↕↗ 🟫                 \n"
                  "                                                         ⬛⬛⬛                 \n"
                  "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                  "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                  "\n")
            time.sleep(1)
            minecraf_logo2()
            print("\n                                                                            \n"
                  "                                                                                \n"
                  "                                                                                \n"
                  "                                                               ↖↕↗ 🟫           \n"
                  "                                                               ⬛⬛⬛           \n"
                  "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                  "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                  "\n")
            time.sleep(1)
            minecraf_logo2()
            print("\n                                                                            \n"
                  "                                                                                \n"
                  "                                                                                \n"
                  "                                                                      ↖↕↗ 🟫           \n"
                  "                                                                      ⬛⬛⬛           \n"
                  "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                  "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                  "\n")
            time.sleep(1)
            minecraf_logo2()
            print("\n                                                                              \n"
                  "                                                                                \n"
                  "                                                                                \n"
                  "                                                                          🟫     \n"
                  "                                                                      ⬛⬛⬛ ↖↕↗ \n"
                  "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                  "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                  "\n")
            print("there you go")
            break
        elif response69 == "s":
            minecraf_logo2()
            print("\n                                                                            \n"
                  "                                                                                \n"
                  "                                                                                \n"
                  "                                   ↖↕↗     🟫                                    \n"
                  "                                       ⬛⬛⬛                                     \n"
                  "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                  "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                  "\n")
            time.sleep(0.6)
            minecraf_logo2()
            print("\n                                                                            \n"
                  "                                                                                \n"
                  "                                                                                \n"
                  "                                           🟫                                    \n"
                  "                                   ↖↕↗ ⬛⬛⬛                                     \n"
                  "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                  "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                  "\n")
        else:
            print("\n[please select an option]\n")
if randome == 'mcA':
        variableC.remove("partA")
        minecraf_logo2()
        print("                                                        ⬛🟪⬛                   \n"
              "                                                        ⬛🟨⬛                   \n"
              "                                                        ⬛⬛⬛                  \n"
              "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
              "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
              "                          ↖↕↗          🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
        print("look there is a HUGE chest at the top of this hill right there, lets see whats inside")
        while True:
            response66 = input("(press R to say i breath air)\nW-move forward\ns-jump\n choose one : ").lower()
            if response66 == "r":
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                        ⬛⬛⬛                  \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "            i breath air .                      🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                          ↖↕↗          🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
            elif response66 == "s":
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                        ⬛⬛⬛                  \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                          ↖↕↗                  🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                time.sleep(0.6)
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                        ⬛⬛⬛                  \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                          ↖↕↗          🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
            elif response66 == "w":
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                        ⬛⬛⬛                  \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                    ↖↕↗🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                break
            else:
                print("\n[please select an option]\n")
        while True:
            print("wow, look at this flower.")
            response65 = input("D-move backwards\nW-move forward\ns-jump\n choose one : ").lower()
            if response65 == "d":
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                        ⬛⬛⬛                  \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                          ↖↕↗          🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                print("look there is a HUGE chest at the top of this hill right there, lets see whats inside")
                while True:
                    response66 = input("(press R to say i breath air)\nW-move forward\ns-jump\n choose one : ").lower()
                    if response66 == "r":
                        minecraf_logo2()
                        print("                                                        ⬛🟪⬛                   \n"
                              "                                                        ⬛🟨⬛                   \n"
                              "                                                        ⬛⬛⬛                  \n"
                              "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                              "            i breath air .                      🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                              "                          ↖↕↗          🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                              "\n")
                    elif response66 == "s":
                        minecraf_logo2()
                        print("                                                        ⬛🟪⬛                   \n"
                              "                                                        ⬛🟨⬛                   \n"
                              "                                                        ⬛⬛⬛                  \n"
                              "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                              "                          ↖↕↗                  🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                              "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                              "\n")
                        time.sleep(0.6)
                        minecraf_logo2()
                        print("                                                        ⬛🟪⬛                   \n"
                              "                                                        ⬛🟨⬛                   \n"
                              "                                                        ⬛⬛⬛                  \n"
                              "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                              "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                              "                          ↖↕↗          🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                              "\n")
                    elif response66 == "w":
                        minecraf_logo2()
                        print("                                                        ⬛🟪⬛                   \n"
                              "                                                        ⬛🟨⬛                   \n"
                              "                                                        ⬛⬛⬛                  \n"
                              "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                              "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                              "                                    ↖↕↗🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                              "\n")
                        break
                    else:
                        print("\n[please select an option]\n")
            elif response65 == "s":
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                        ⬛⬛⬛                  \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                    ↖↕↗         🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                time.sleep(0.6)
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                        ⬛⬛⬛                  \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                    ↖↕↗🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
            elif response65 == "w":
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                        ⬛⬛⬛                  \n"
                      "                                                ↖↕↗ 🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                break
            else:
                print("\n[please select an option]\n")
        while True:
            response70 = input("(press K to kill yourself)\nD-move backwards\nW-move forward\ns-jump\n choose one : ").lower()
            if response70 == "d":
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                        ⬛⬛⬛                  \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                    ↖↕↗🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                while True:
                    print("wow, look at this flower.")
                    response64 = input("W-move forward\ns-jump\n choose one : ").lower()
                    if response64 == "s":
                        minecraf_logo2()
                        print("                                                        ⬛🟪⬛                   \n"
                              "                                                        ⬛🟨⬛                   \n"
                              "                                                        ⬛⬛⬛                  \n"
                              "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                              "                                    ↖↕↗         🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                              "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                              "\n")
                        time.sleep(0.6)
                        minecraf_logo2()
                        print("                                                        ⬛🟪⬛                   \n"
                              "                                                        ⬛🟨⬛                   \n"
                              "                                                        ⬛⬛⬛                  \n"
                              "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                              "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                              "                                    ↖↕↗🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                              "\n")
                    elif response64 == "w":
                        minecraf_logo2()
                        print("                                                        ⬛🟪⬛                   \n"
                              "                                                        ⬛🟨⬛                   \n"
                              "                                                        ⬛⬛⬛                  \n"
                              "                                                ↖↕↗ 🟩🟩🟩🟩🟩🟩🟩             \n"
                              "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                              "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                              "\n")
                        break
                else:
                    print("\n[please select an option]\n")
            elif response70 == "w":
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                     ↖↕↗⬛⬛⬛                  \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                break
            elif response70 == "s":
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                ↖↕↗     ⬛⬛⬛                  \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                time.sleep(0.6)
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                        ⬛⬛⬛                  \n"
                      "                                                ↖↕↗ 🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
            elif response70 == "k":
                print("  _____  \n"
                      " /     \ \n"
                      "| () () |\n"
                      " \  ^  / \n"
                      "  |||||  \n"
                      "  |||||  ")
                print("WHY WHOULD YOU DO THAT")
                quit()
            else:
                print("\n[please select an option]\n")
        while True:
            print("lets see whats inside now")
            response71 = input("O-open the chest\nD-move backwards\ns-jump\n choose one : ").lower()
            if response71 == "d":
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                        ⬛⬛⬛                  \n"
                      "                                                ↖↕↗ 🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                while True:
                    response72 = input("(press K to kill yourself)\nW-move forward\ns-jump\n choose one : ").lower()
                    if response72 == "w":
                        minecraf_logo2()
                        print("                                                        ⬛🟪⬛                   \n"
                              "                                                        ⬛🟨⬛                   \n"
                              "                                                     ↖↕↗⬛⬛⬛                  \n"
                              "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                              "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                              "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                              "\n")
                        break
                    elif response72 == "s":
                        minecraf_logo2()
                        print("                                                        ⬛🟪⬛                   \n"
                              "                                                        ⬛🟨⬛                   \n"
                              "                                                ↖↕↗     ⬛⬛⬛                  \n"
                              "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                              "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                              "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                              "\n")
                        time.sleep(0.6)
                        minecraf_logo2()
                        print("                                                        ⬛🟪⬛                   \n"
                              "                                                        ⬛🟨⬛                   \n"
                              "                                                        ⬛⬛⬛                  \n"
                              "                                                ↖↕↗ 🟩🟩🟩🟩🟩🟩🟩             \n"
                              "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                              "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                              "\n")
                    elif response72 == "k":
                        print("k")
                    else:
                        print("\n[please select an option]\n")
            elif response71 == "o":
                if random2 == "v1":
                    minecraf_logo2()
                    print("                                                                                 \n"
                          "                                                        ⬛🟨⬛                   \n"
                          "                                                     ↖↕↗⬛⬛⬛                  \n"
                          "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                          "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                          "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                          "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                          "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                          "\n")
                    time.sleep(1)
                    minecraf_logo2()
                    print("                                                                                 \n"
                          "      +16 diamond                                                                           \n"
                          "      +64 emerald                                    ↖↕↗                          \n"
                          "      +1 diamond helmet                             🟩🟩🟩🟩🟩🟩🟩             \n"
                          "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                          "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                          "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                          "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                          "\n")
                elif random2 == "v2":
                    minecraf_logo2()
                    print("                                                                                 \n"
                          "                                                        ⬛🟨⬛                   \n"
                          "                                                     ↖↕↗⬛⬛⬛                  \n"
                          "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                          "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                          "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                          "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                          "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                          "\n")
                    time.sleep(1)
                    minecraf_logo2()
                    print("                                                                                 \n"
                          "      +20 diamond                                                                           \n"
                          "      +64 beef                                       ↖↕↗                          \n"
                          "      +1 diamond leggings                           🟩🟩🟩🟩🟩🟩🟩             \n"
                          "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                          "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                          "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                          "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                          "\n")
                elif random2 == "v3":
                    minecraf_logo2()
                    print("                                                                                 \n"
                          "                                                        ⬛🟨⬛                   \n"
                          "                                                     ↖↕↗⬛⬛⬛                  \n"
                          "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                          "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                          "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                          "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                          "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                          "\n")
                    time.sleep(1)
                    minecraf_logo2()
                    print("                                                                                 \n"
                          "      +1 diamond                                                                           \n"
                          "      +64 coal                                       ↖↕↗                          \n"
                          "      +1 diamond helmet                             🟩🟩🟩🟩🟩🟩🟩             \n"
                          "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                          "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                          "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                          "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                          "\n")
                break
            elif response71 == "s":
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                     ↖↕↗⬛🟨⬛                   \n"
                      "                                                        ⬛⬛⬛                  \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                time.sleep(0.6)
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                     ↖↕↗⬛⬛⬛                  \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
            else:
                print("\n[please select an option]\n")
        while True:
            responsee = input("press H to say somethin\nW-move forward\ns-jump\n choose one : ").lower()
            if responsee == "w":
                minecraf_logo2()
                print("                                                                                 \n"
                      "                                                                                 \n"
                      "                                                                 ↖↕↗             \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                time.sleep(1)
                minecraf_logo2()
                print("                                                                                 \n"
                      "                                                                                 \n"
                      "                                                                                 \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩          \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩↖↕↗   \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                break
            elif responsee == "h":
                minecraf_logo2()
                print("                                                                                 \n"
                      "                                      lets go homee .                            \n"
                      "                                                     ↖↕↗                          \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
            elif responsee == "s":
                minecraf_logo2()
                print("                                                                                 \n"
                      "                                                     ↖↕↗                           \n"
                      "                                                                                 \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                time.sleep(0.6)
                print("                                                                                 \n"
                      "                                                                                 \n"
                      "                                                     ↖↕↗                          \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
            else:
                print("\n[please select an option]\n")

randomM = random.choice(variableC)

ccc2 =input("you traveled 2 whole chunks by now, press enter to load a new one! : ")
minecraf_logo2()
print("                                                           \n"
      "                                                   ↖↕↗    \n"
      "                                              🟩🟩🟩🟩🟩🟩\n"
      "                                              🟫🟫🟫🟫🟫🟫\n")

print("                                                ... 3 ...")
time.sleep(1)
print("                                                 .. 2 ..")
time.sleep(1)
print("                                                  . 1 .")

if randomM == 'partB':
        minecraf_logo2()
        print("\n                                                                            \n"
              "                                                                                \n"
              "                                                                                \n"
              "                                           🟫                                    \n"
              "                          ↖↕↗          ⬛⬛⬛                                     \n"
              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
        print("it seems like a small lake generated but lucky for you that there is a boat right there!")
        while True:
            response69 = input("press R to say i love water\nW-move forward\ns-jump\n choose one : ").lower()
            if response69 == "r":
                minecraf_logo2()
                print("\n                                                                            \n"
                      "                                                                                \n"
                      "                                                                                \n"
                      "           i love water! .                 🟫                                    \n"
                      "                          ↖↕↗          ⬛⬛⬛                                     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
            elif response69 == "w":
                minecraf_logo2()
                print("\n                                                                            \n"
                      "                                                                                \n"
                      "                                                                                \n"
                      "                                           🟫                                    \n"
                      "                                   ↖↕↗ ⬛⬛⬛                                     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                break
            elif response69 == "s":
                minecraf_logo2()
                print("\n                                                                            \n"
                      "                                                                                \n"
                      "                                                                                \n"
                      "                          ↖↕↗              🟫                                    \n"
                      "                                       ⬛⬛⬛                                     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                time.sleep(0.6)
                minecraf_logo2()
                print("\n                                                                            \n"
                      "                                                                                \n"
                      "                                                                                \n"
                      "                                           🟫                                    \n"
                      "                          ↖↕↗          ⬛⬛⬛                                     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
            else:
                print("\n[please select an option]\n")
        while True:
            response69 = input("press R to say something important\nD-move backwards\nW-get in the boat\nS-jump\n choose one : ").lower()
            if response69 == "d":
                minecraf_logo2()
                print("\n                                                                            \n"
                      "                                                                                \n"
                      "                                                                                \n"
                      "                                           🟫                                    \n"
                      "                          ↖↕↗          ⬛⬛⬛                                     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                print("it seems like a small lake generated but lucky for you that there is a boat right there!")
                while True:
                    response68 = input("press R to say i love water\nW-move forward\ns-jump\n choose one : ").lower()
                    if response68 == "r":
                        minecraf_logo2()
                        print("\n                                                                            \n"
                              "                                                                                \n"
                              "                                                                                \n"
                              "           i love water! .                 🟫                                    \n"
                              "                          ↖↕↗          ⬛⬛⬛                                     \n"
                              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                              "\n")
                    elif response68 == "w":
                        minecraf_logo2()
                        print("\n                                                                            \n"
                              "                                                                                \n"
                              "                                                                                \n"
                              "                                           🟫                                    \n"
                              "                                   ↖↕↗ ⬛⬛⬛                                     \n"
                              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                              "\n")
                        break
                    elif response68 == "s":
                        minecraf_logo2()
                        print("\n                                                                            \n"
                              "                                                                                \n"
                              "                                                                                \n"
                              "                          ↖↕↗              🟫                                    \n"
                              "                                       ⬛⬛⬛                                     \n"
                              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                              "\n")
                        time.sleep(0.6)
                        minecraf_logo2()
                        print("\n                                                                            \n"
                              "                                                                                \n"
                              "                                                                                \n"
                              "                                           🟫                                    \n"
                              "                          ↖↕↗          ⬛⬛⬛                                     \n"
                              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                              "\n")
                    else:
                        print("\n[please select an option]\n")
            elif response69 == "w":
                minecraf_logo2()
                print("\n                                                                            \n"
                      "                                                                                \n"
                      "                                                                                \n"
                      "                                       ↖↕↗ 🟫                                    \n"
                      "                                       ⬛⬛⬛                                     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                time.sleep(1)
                minecraf_logo2()
                print("\n                                                                            \n"
                      "                                                                                \n"
                      "                                                                                \n"
                      "                                             ↖↕↗ 🟫                            \n"
                      "                                             ⬛⬛⬛                             \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                time.sleep(1)
                minecraf_logo2()
                print("\n                                                                            \n"
                      "                                                                                \n"
                      "                                                                                \n"
                      "                                                   ↖↕↗ 🟫                       \n"
                      "                                                   ⬛⬛⬛                       \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                time.sleep(1)
                minecraf_logo2()
                print("\n                                                                            \n"
                      "                                                                                \n"
                      "                                                                                \n"
                      "                                                         ↖↕↗ 🟫                 \n"
                      "                                                         ⬛⬛⬛                 \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                time.sleep(1)
                minecraf_logo2()
                print("\n                                                                            \n"
                      "                                                                                \n"
                      "                                                                                \n"
                      "                                                               ↖↕↗ 🟫           \n"
                      "                                                               ⬛⬛⬛           \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                time.sleep(1)
                minecraf_logo2()
                print("\n                                                                            \n"
                      "                                                                                \n"
                      "                                                                                \n"
                      "                                                                      ↖↕↗ 🟫           \n"
                      "                                                                      ⬛⬛⬛           \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                time.sleep(1)
                minecraf_logo2()
                print("\n                                                                              \n"
                      "                                                                                \n"
                      "                                                                                \n"
                      "                                                                          🟫     \n"
                      "                                                                      ⬛⬛⬛ ↖↕↗ \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                print("there you go")
                break
            elif response69 == "r":
                minecraf_logo2()
                print("\n                                                                             \n"
                      "                                                                                \n"
                      "      did you know that                                                         \n"
                      "       Robert aka GIGI made this? .        🟫                                    \n"
                      "                                   ↖↕↗ ⬛⬛⬛                                    \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
            elif response69 == "s":
                minecraf_logo2()
                print("\n                                                                            \n"
                      "                                                                                \n"
                      "                                                                                \n"
                      "                                   ↖↕↗     🟫                                    \n"
                      "                                       ⬛⬛⬛                                     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                time.sleep(0.6)
                minecraf_logo2()
                print("\n                                                                            \n"
                      "                                                                                \n"
                      "                                                                                \n"
                      "                                           🟫                                    \n"
                      "                                   ↖↕↗ ⬛⬛⬛                                     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
            else:
                print("\n[please select an option]\n")
if randomM == 'partA':
        minecraf_logo2()
        print("                                                        ⬛🟪⬛                   \n"
              "                                                        ⬛🟨⬛                   \n"
              "                                                        ⬛⬛⬛                  \n"
              "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
              "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
              "                          ↖↕↗          🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
        print("look there is a HUGE chest at the top of this hill right there, lets see whats inside")
        while True:
            response66 = input("(press R to say i breath air)\nW-move forward\ns-jump\n choose one : ").lower()
            if response66 == "r":
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                        ⬛⬛⬛                  \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "            i breath air .                      🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                          ↖↕↗          🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
            elif response66 == "s":
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                        ⬛⬛⬛                  \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                          ↖↕↗                  🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                time.sleep(0.6)
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                        ⬛⬛⬛                  \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                          ↖↕↗          🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
            elif response66 == "w":
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                        ⬛⬛⬛                  \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                    ↖↕↗🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                break
            else:
                print("\n[please select an option]\n")
        while True:
            print("wow, look at this flower.")
            response65 = input("D-move backwards\nW-move forward\ns-jump\n choose one : ").lower()
            if response65 == "d":
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                        ⬛⬛⬛                  \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                          ↖↕↗          🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                print("look there is a HUGE chest at the top of this hill right there, lets see whats inside")
                while True:
                    response66 = input("(press R to say i breath air)\nW-move forward\ns-jump\n choose one : ").lower()
                    if response66 == "r":
                        minecraf_logo2()
                        print("                                                        ⬛🟪⬛                   \n"
                              "                                                        ⬛🟨⬛                   \n"
                              "                                                        ⬛⬛⬛                  \n"
                              "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                              "            i breath air .                      🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                              "                          ↖↕↗          🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                              "\n")
                    elif response66 == "s":
                        minecraf_logo2()
                        print("                                                        ⬛🟪⬛                   \n"
                              "                                                        ⬛🟨⬛                   \n"
                              "                                                        ⬛⬛⬛                  \n"
                              "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                              "                          ↖↕↗                  🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                              "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                              "\n")
                        time.sleep(0.6)
                        minecraf_logo2()
                        print("                                                        ⬛🟪⬛                   \n"
                              "                                                        ⬛🟨⬛                   \n"
                              "                                                        ⬛⬛⬛                  \n"
                              "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                              "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                              "                          ↖↕↗          🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                              "\n")
                    elif response66 == "w":
                        minecraf_logo2()
                        print("                                                        ⬛🟪⬛                   \n"
                              "                                                        ⬛🟨⬛                   \n"
                              "                                                        ⬛⬛⬛                  \n"
                              "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                              "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                              "                                    ↖↕↗🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                              "\n")
                        break
                    else:
                        print("\n[please select an option]\n")
            elif response65 == "s":
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                        ⬛⬛⬛                  \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                    ↖↕↗         🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                time.sleep(0.6)
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                        ⬛⬛⬛                  \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                    ↖↕↗🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
            elif response66 == "w":
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                        ⬛⬛⬛                  \n"
                      "                                                ↖↕↗ 🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                break
            else:
                print("\n[please select an option]\n")
        while True:
            response70 = input(
                "(press K to kill yourself)\nD-move backwards\nW-move forward\ns-jump\n choose one : ").lower()
            if response70 == "d":
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                        ⬛⬛⬛                  \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                    ↖↕↗🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                while True:
                    print("wow, look at this flower.")
                    response64 = input("W-move forward\ns-jump\n choose one : ".lower())
                    if response64 == "s":
                        minecraf_logo2()
                        print("                                                        ⬛🟪⬛                   \n"
                              "                                                        ⬛🟨⬛                   \n"
                              "                                                        ⬛⬛⬛                  \n"
                              "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                              "                                    ↖↕↗         🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                              "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                              "\n")
                        time.sleep(0.6)
                        minecraf_logo2()
                        print("                                                        ⬛🟪⬛                   \n"
                              "                                                        ⬛🟨⬛                   \n"
                              "                                                        ⬛⬛⬛                  \n"
                              "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                              "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                              "                                    ↖↕↗🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                              "\n")
                    elif response64 == "w":
                        minecraf_logo2()
                        print("                                                        ⬛🟪⬛                   \n"
                              "                                                        ⬛🟨⬛                   \n"
                              "                                                        ⬛⬛⬛                  \n"
                              "                                                ↖↕↗ 🟩🟩🟩🟩🟩🟩🟩             \n"
                              "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                              "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                              "\n")
                        break
                else:
                    print("\n[please select an option]\n")
            elif response70 == "w":
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                     ↖↕↗⬛⬛⬛                  \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                break
            elif response70 == "s":
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                ↖↕↗     ⬛⬛⬛                  \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                time.sleep(0.6)
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                        ⬛⬛⬛                  \n"
                      "                                                ↖↕↗ 🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
            elif response70 == "k":
                print("  _____  \n"
                      " /     \ \n"
                      "| () () |\n"
                      " \  ^  / \n"
                      "  |||||  \n"
                      "  |||||  ")
                print("WHY WHOULD YOU DO THAT")
                quit()
            else:
                print("\n[please select an option]\n")
        while True:
            print("lets see whats inside now")
            response71 = input("O-open the chest\nD-move backwards\ns-jump\n choose one : ").lower()
            if response71 == "d":
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                        ⬛⬛⬛                  \n"
                      "                                                ↖↕↗ 🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                while True:
                    response72 = input("(press K to kill yourself)\nW-move forward\ns-jump\n choose one : ").lower()
                    if response72 == "w":
                        minecraf_logo2()
                        print("                                                        ⬛🟪⬛                   \n"
                              "                                                        ⬛🟨⬛                   \n"
                              "                                                     ↖↕↗⬛⬛⬛                  \n"
                              "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                              "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                              "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                              "\n")
                        break
                    elif response72 == "s":
                        minecraf_logo2()
                        print("                                                        ⬛🟪⬛                   \n"
                              "                                                        ⬛🟨⬛                   \n"
                              "                                                ↖↕↗     ⬛⬛⬛                  \n"
                              "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                              "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                              "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                              "\n")
                        time.sleep(0.6)
                        minecraf_logo2()
                        print("                                                        ⬛🟪⬛                   \n"
                              "                                                        ⬛🟨⬛                   \n"
                              "                                                        ⬛⬛⬛                  \n"
                              "                                                ↖↕↗ 🟩🟩🟩🟩🟩🟩🟩             \n"
                              "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                              "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                              "\n")
                    elif response72 == "k":
                        print("k")
                    else:
                        print("\n[please select an option]\n")
            elif response71 == "o":
                if random2 == "v1":
                    minecraf_logo2()
                    print("                                                                                 \n"
                          "                                                        ⬛🟨⬛                   \n"
                          "                                                     ↖↕↗⬛⬛⬛                  \n"
                          "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                          "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                          "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                          "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                          "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                          "\n")
                    time.sleep(1)
                    minecraf_logo2()
                    print("                                                                                 \n"
                          "      +16 diamond                                                                  \n"
                          "      +64 emerald                                    ↖↕↗                          \n"
                          "      +1 diamond helmet                             🟩🟩🟩🟩🟩🟩🟩             \n"
                          "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                          "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                          "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                          "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                          "\n")
                elif random2 == "v2":
                    minecraf_logo2()
                    print("                                                                                 \n"
                          "                                                        ⬛🟨⬛                   \n"
                          "                                                     ↖↕↗⬛⬛⬛                  \n"
                          "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                          "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                          "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                          "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                          "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                          "\n")
                    time.sleep(1)
                    minecraf_logo2()
                    print("                                                                                 \n"
                          "      +20 diamond                                                                           \n"
                          "      +64 beef                                       ↖↕↗                          \n"
                          "      +1 diamond leggings                           🟩🟩🟩🟩🟩🟩🟩             \n"
                          "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                          "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                          "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                          "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                          "\n")
                elif random2 == "v3":
                    minecraf_logo2()
                    print("                                                                                 \n"
                          "                                                        ⬛🟨⬛                   \n"
                          "                                                     ↖↕↗⬛⬛⬛                  \n"
                          "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                          "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                          "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                          "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                          "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                          "\n")
                    time.sleep(1)
                    minecraf_logo2()
                    print("                                                                                 \n"
                          "      +1 diamond                                                                           \n"
                          "      +64 coal                                       ↖↕↗                          \n"
                          "      +1 diamond helmet                             🟩🟩🟩🟩🟩🟩🟩             \n"
                          "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                          "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                          "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                          "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                          "\n")
                break
            elif response71 == "s":
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                     ↖↕↗⬛🟨⬛                   \n"
                      "                                                        ⬛⬛⬛                  \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                time.sleep(0.6)
                minecraf_logo2()
                print("                                                        ⬛🟪⬛                   \n"
                      "                                                        ⬛🟨⬛                   \n"
                      "                                                     ↖↕↗⬛⬛⬛                  \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
            else:
                print("\n[please select an option]\n")
        while True:
            responsee = input("press H to say somethin\nW-move forward\ns-jump\n choose one : ").lower()
            if responsee == "w":
                minecraf_logo2()
                print("                                                                                 \n"
                      "                                                                                 \n"
                      "                                                                 ↖↕↗             \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                time.sleep(1)
                minecraf_logo2()
                print("                                                                                 \n"
                      "                                                                                 \n"
                      "                                                                                 \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩          \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩↖↕↗   \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                break
            elif responsee == "h":
                minecraf_logo2()
                print("                                                                                 \n"
                      "                                      lets go homee .                            \n"
                      "                                                     ↖↕↗                          \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
            elif responsee == "s":
                minecraf_logo2()
                print("                                                                                 \n"
                      "                                                     ↖↕↗                           \n"
                      "                                                                                 \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
                time.sleep(0.6)
                minecraf_logo2()
                print("                                                                                 \n"
                      "                                                                                 \n"
                      "                                                     ↖↕↗                          \n"
                      "                                                    🟩🟩🟩🟩🟩🟩🟩             \n"
                      "                                                🟩🟩🟩🟫🟫🟫🟫🟫🟩🟩           \n"
                      "                                       🟣  🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩     \n"
                      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟩🟩🟩🟩\n"
                      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
                      "\n")
            else:
                print("\n[please select an option]\n")

ccc33 =input("you traveled 3 whole chunks by now, press enter to load a new one! : ")
minecraf_logo2()
print("                                                           \n"
      "                                                   ↖↕↗    \n"
      "                                              🟩🟩🟩🟩🟩🟩\n"
      "                                              🟫🟫🟫🟫🟫🟫\n")

print("                                                ... 3 ...")
time.sleep(1)
print("                                                 .. 2 ..")
time.sleep(1)
print("                                                  . 1 .")

minecraf_logo2()
print("                                                    🟫⬛🟫⬛🟫                   \n"
      "                                                  ⬛🟫🟫🟫🟫🟫⬛                \n"
      "                                                 🟫🟫🟫🟫🟫🟫🟫🟫          🟩   \n"
      "                                                 ⬛⬛⬛⬛⬛⬛⬛⬛        🟩🟩🟩 \n"
      "                                                 ⬛🟦⬛⬛⬛⬛🟦⬛      🟩🟩🟩🟩🟩\n"
      "                                                 ⬛🟦⬛🟥🟧⬛🟦⬛          ⬛     \n"
      "                          ↖↕↗                    ⬛⬛⬛🟧🟥⬛⬛⬛          ⬛     \n"
      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
      "\n")
while True:
    response57 = input("FINALLY, sweet home\nW-move forward\ns-jump\n choose one : ").lower()
    if response57 == "s":
        minecraf_logo()
        print("                                                    🟫⬛🟫⬛🟫                   \n"
              "                                                  ⬛🟫🟫🟫🟫🟫⬛                \n"
              "                                                 🟫🟫🟫🟫🟫🟫🟫🟫          🟩   \n"
              "                                                 ⬛⬛⬛⬛⬛⬛⬛⬛        🟩🟩🟩 \n"
              "                                                 ⬛🟦⬛⬛⬛⬛🟦⬛      🟩🟩🟩🟩🟩\n"
              "                          ↖↕↗                    ⬛🟦⬛🟥🟧⬛🟦⬛          ⬛     \n"
              "                                                 ⬛⬛⬛🟧🟥⬛⬛⬛          ⬛     \n"
              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
        time.sleep(0.6)
        minecraf_logo2()
        print("                                                    🟫⬛🟫⬛🟫                   \n"
              "                                                  ⬛🟫🟫🟫🟫🟫⬛                \n"
              "                                                 🟫🟫🟫🟫🟫🟫🟫🟫          🟩   \n"
              "                                                 ⬛⬛⬛⬛⬛⬛⬛⬛        🟩🟩🟩 \n"
              "                                                 ⬛🟦⬛⬛⬛⬛🟦⬛      🟩🟩🟩🟩🟩\n"
              "                                                 ⬛🟦⬛🟥🟧⬛🟦⬛          ⬛     \n"
              "                          ↖↕↗                    ⬛⬛⬛🟧🟥⬛⬛⬛          ⬛     \n"
              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
    elif response57 == "w":
        minecraf_logo2()
        print("                                                    🟫⬛🟫⬛🟫                   \n"
              "                                                  ⬛🟫🟫🟫🟫🟫⬛                \n"
              "                                                 🟫🟫🟫🟫🟫🟫🟫🟫          🟩   \n"
              "                                                 ⬛⬛⬛⬛⬛⬛⬛⬛        🟩🟩🟩 \n"
              "                                                 ⬛🟦⬛⬛⬛⬛🟦⬛      🟩🟩🟩🟩🟩\n"
              "                         this is my house .      ⬛🟦⬛🟥🟧⬛🟦⬛          ⬛     \n"
              "                                           ↖↕↗   ⬛⬛⬛🟧🟥⬛⬛⬛          ⬛     \n"
              "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
              "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
              "\n")
        break
def d():
    d = input("enter for skip ")

d()
minecraf_logo2()
print("                                                    🟫⬛🟫⬛🟫                   \n"
      "                                                  ⬛🟫🟫🟫🟫🟫⬛                \n"
      "                                                 🟫🟫🟫🟫🟫🟫🟫🟫          🟩   \n"
      "                                                 ⬛⬛⬛⬛⬛⬛⬛⬛        🟩🟩🟩 \n"
      "                                                 ⬛🟦⬛⬛⬛⬛🟦⬛      🟩🟩🟩🟩🟩\n"
      "                         do you like it? .       ⬛🟦⬛🟥🟧⬛🟦⬛          ⬛     \n"
      "                                           ↖↕↗   ⬛⬛⬛🟧🟥⬛⬛⬛          ⬛    \n"
      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
      "\n")
d()
minecraf_logo2()
print("                                                    🟫⬛🟫⬛🟫                   \n"
      "                                                  ⬛🟫🟫🟫🟫🟫⬛                \n"
      "                                                 🟫🟫🟫🟫🟫🟫🟫🟫          🟩   \n"
      "                                                 ⬛⬛⬛⬛⬛⬛⬛⬛        🟩🟩🟩 \n"
      "                                                 ⬛🟦⬛⬛⬛⬛🟦⬛      🟩🟩🟩🟩🟩\n"
      "           thanks for helping me anyways .       ⬛🟦⬛🟥🟧⬛🟦⬛          ⬛     \n"
      "                                           ↖↕↗   ⬛⬛⬛🟧🟥⬛⬛⬛          ⬛    \n"
      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
      "\n")
d()
minecraf_logo2()
print("                                                    🟫⬛🟫⬛🟫                   \n"
      "                                                  ⬛🟫🟫🟫🟫🟫⬛                \n"
      "                                                 🟫🟫🟫🟫🟫🟫🟫🟫          🟩   \n"
      "                                                 ⬛⬛⬛⬛⬛⬛⬛⬛        🟩🟩🟩 \n"
      "              is rly good that we made it        ⬛🟦⬛⬛⬛⬛🟦⬛      🟩🟩🟩🟩🟩\n"
      "                before the night arrived .       ⬛🟦⬛🟥🟧⬛🟦⬛          ⬛     \n"
      "                                           ↖↕↗   ⬛⬛⬛🟧🟥⬛⬛⬛          ⬛    \n"
      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
      "\n")
d()
minecraf_logo2()
print("                                                    🟫⬛🟫⬛🟫                   \n"
      "                                                  ⬛🟫🟫🟫🟫🟫⬛                \n"
      "                                                 🟫🟫🟫🟫🟫🟫🟫🟫          🟩   \n"
      "                                                 ⬛⬛⬛⬛⬛⬛⬛⬛        🟩🟩🟩 \n"
      "                                                 ⬛🟦⬛⬛⬛⬛🟦⬛      🟩🟩🟩🟩🟩\n"
      "                    i gotta go for now..  .      ⬛🟦⬛🟥🟧⬛🟦⬛          ⬛     \n"
      "                                           ↖↕↗   ⬛⬛⬛🟧🟥⬛⬛⬛          ⬛    \n"
      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
      "\n")
d()
minecraf_logo2()
print("                                                    🟫⬛🟫⬛🟫                   \n"
      "                                                  ⬛🟫🟫🟫🟫🟫⬛                \n"
      "                                                 🟫🟫🟫🟫🟫🟫🟫🟫          🟩   \n"
      "                                                 ⬛⬛⬛⬛⬛⬛⬛⬛        🟩🟩🟩 \n"
      "                                                 ⬛🟦⬛⬛⬛⬛🟦⬛      🟩🟩🟩🟩🟩\n"
      "                      so, stay safe ok?  .       ⬛🟦⬛🟥🟧⬛🟦⬛          ⬛     \n"
      "                                           ↖↕↗   ⬛⬛⬛🟧🟥⬛⬛⬛          ⬛    \n"
      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
      "\n")
d()
minecraf_logo2()
print("                                                    🟫⬛🟫⬛🟫                   \n"
      "                                                  ⬛🟫🟫🟫🟫🟫⬛                \n"
      "                                                 🟫🟫🟫🟫🟫🟫🟫🟫          🟩   \n"
      "                                                 ⬛⬛⬛⬛⬛⬛⬛⬛        🟩🟩🟩 \n"
      "                                                 ⬛🟦⬛⬛⬛⬛🟦⬛      🟩🟩🟩🟩🟩\n"
      "                                                 ⬛🟦⬛🟥🟧⬛🟦⬛          ⬛     \n"
      "                                                 ⬛⬛⬛🟧🟥⬛⬛⬛          ⬛    \n"
      "                      🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩🟩\n"
      "                     🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫🟫\n"
      "\n")
time.sleep(2)
minecraf_logo2()
print("\n                          ████████╗██╗░░██╗███████╗  ███████╗███╗░░██╗██████╗░\n"
      "                          ╚══██╔══╝██║░░██║██╔════╝  ██╔════╝████╗░██║██╔══██╗\n"
      "                          ░░░██║░░░███████║█████╗░░  █████╗░░██╔██╗██║██║░░██║\n"
      "                          ░░░██║░░░██╔══██║██╔══╝░░  ██╔══╝░░██║╚████║██║░░██║\n"
      "                          ░░░██║░░░██║░░██║███████╗  ███████╗██║░╚███║██████╔╝\n"
      "                          ░░░╚═╝░░░╚═╝░░╚═╝╚══════╝  ╚══════╝╚═╝░░╚══╝╚═════╝░\n")
print("thank you for playing!")
print("\nOfficial made by robert aka GIGI")
